Tekla Open API Reference for Tekla Structures 2025
AnalysisSupport Class
 The AnalysisSupport class contains information related to analysis supports.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisSupport
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisSupport
Public NotInheritable Class AnalysisSupport
The AnalysisSupport type exposes the following members.
Constructors
Name | Description
AnalysisSupport
Initializes a new instance of the AnalysisSupport class
Top
Properties
Name | Description
Spring
 The spring values of the connectivity.
Support
 The connectivity type of the connectivity.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace